-- phpMyAdmin SQL Dump
-- version 4.6.1
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Сен 16 2016 г., 10:30
-- Версия сервера: 5.5.36-34.0-632.precise
-- Версия PHP: 5.6.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `shiftmr_youtube`
--

-- --------------------------------------------------------

--
-- Структура таблицы `chat`
--

CREATE TABLE IF NOT EXISTS `chat` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `message` tinytext NOT NULL,
  `user` varchar(20) NOT NULL,
  `time` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=107 DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE IF NOT EXISTS `comments` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `material` int(11) NOT NULL,
  `module` int(11) NOT NULL,
  `added` varchar(20) NOT NULL,
  `text` tinytext NOT NULL,
  `date` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=186 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `material`, `module`, `added`, `text`, `date`) VALUES
(1, 29, 1, 'simplerss', 'лол. комментарии заработали', '2015-05-28 10:50:07'),
(65, 114, 1, 'Sireus', 'о, оценочки))', '2015-10-03 19:09:42'),
(12, 27, 1, 'savalan', '56525632', '2015-05-28 16:52:08'),
(13, 29, 1, 'qwerty', '6556', '2015-05-28 19:19:11'),
(85, 29, 1, 'IAJdjasd', 'авыаыаываываыаыа', '2015-11-08 20:43:44'),
(16, 6, 2, 'simplerss', 'круто', '2015-06-05 11:43:58'),
(18, 1, 2, 'VladM', 'f', '2015-06-07 17:12:09'),
(67, 114, 1, 'arsen', 'Нормально , у тебя как?', '2015-10-04 00:13:05'),
(22, 29, 1, 'admin4ik', 'Класс', '2015-06-14 01:21:45'),
(23, 29, 1, 'sserega93', 'Ну норм так!', '2015-06-14 01:42:21'),
(25, 18, 1, 'simplerss', 'sadfds', '2015-06-15 14:46:01'),
(68, 114, 1, 'Nikitaz58', 'пока не родила', '2015-10-10 18:21:07'),
(27, 6, 2, 'po61', 'o.o', '2015-06-22 21:27:07'),
(74, 5, 2, 'Den', 'xvc', '2015-10-17 23:19:41'),
(30, 17, 1, 'alexandro', '1123', '2015-06-30 17:45:18'),
(32, 1, 2, 'Yookys', 'wer', '2015-07-01 16:58:14'),
(97, 18, 1, 'OxxxyMiron', 'qwe', '2015-11-16 01:41:32'),
(96, 6, 2, 'simbiot', 'А где файлы с урока?', '2015-11-14 09:06:57'),
(36, 1, 2, 'diagor', '123', '2015-07-20 14:22:19'),
(37, 29, 1, 'Pudgergun0', 'trsf', '2015-07-22 20:31:47'),
(38, 29, 1, 'Pudgergun0', 'wgafd', '2015-07-22 20:31:48'),
(39, 29, 1, 'Pudgergun0', 'ewrdfdsf', '2015-07-22 20:31:50'),
(40, 29, 1, 'Pudgergun0', '324ewewsfr', '2015-07-22 20:31:52'),
(41, 29, 1, 'Pudgergun0', '432we3rwe', '2015-07-22 20:31:53'),
(42, 29, 1, 'Pudgergun0', 'ЭТО ВСЕ ТЕСТ', '2015-07-22 20:31:59'),
(43, 3, 2, 'RadCor', 'Йо)', '2015-07-23 14:23:52'),
(44, 3, 2, 'quadra', 'test', '2015-07-23 16:50:10'),
(75, 114, 1, 'qwertyuiop', 'Норм', '2015-10-20 22:12:03'),
(84, 29, 1, 'IAJdjasd', 'а', '2015-11-08 20:43:40'),
(47, 29, 1, 'skomeika', '123', '2015-07-30 16:26:41'),
(72, 4, 2, 'teren', 'sdsd', '2015-10-12 23:57:21'),
(83, 29, 1, 'IAJdjasd', 'ывавыаыв', '2015-11-08 20:43:39'),
(51, 16, 1, 'skomeika', 'тут был sk0m', '2015-08-05 13:38:43'),
(52, 16, 1, 'skomeika', 'и ему понравилось!)', '2015-08-05 13:38:54'),
(56, 14, 1, 'Nikitaz58', 'ак', '2015-08-18 21:48:28'),
(82, 29, 1, 'IAJdjasd', 'фыргшф', '2015-11-08 20:43:34'),
(81, 8, 2, 'id24276114', 'efef', '2015-11-08 12:14:21'),
(59, 27, 1, 'mnos', 'лул', '2015-09-11 19:42:56'),
(60, 3, 2, 'Sergey190', 'норм делаешь)', '2015-09-22 15:45:39'),
(61, 29, 1, 'Sireus', 'frtg', '2015-09-25 13:47:59'),
(62, 29, 1, 'AlexLon', 'dadada', '2015-09-26 16:57:05'),
(63, 29, 1, 'simplerss', 'asdasd', '2015-09-27 12:45:50'),
(64, 114, 1, 'admin4ik', 'Все норм)', '2015-09-28 00:02:55'),
(76, 1, 1, 'qwertyuiop', 'Да', '2015-10-20 22:13:24'),
(77, 3, 2, 'Ishtvan', 'LOL', '2015-10-22 21:40:03'),
(78, 114, 1, 'andrey2106', 'по кайфу', '2015-10-24 22:00:48'),
(79, 114, 1, 'evroremont', 'Как у прокурора))', '2015-10-24 23:33:16'),
(86, 29, 1, 'IAJdjasd', 'вы', '2015-11-08 20:43:45'),
(87, 29, 1, 'IAJdjasd', 'Salam', '2015-11-08 20:43:54'),
(88, 29, 1, 'IAJdjasd', 'sa', '2015-11-08 20:43:57'),
(89, 29, 1, 'IAJdjasd', 'sa', '2015-11-08 20:43:58'),
(90, 8, 2, 'IAJdjasd', 'Wow', '2015-11-08 20:44:32'),
(91, 3, 2, 'IAJdjasd', 'dfgfdgdfgdfg', '2015-11-08 21:40:04'),
(92, 3, 2, 'IAJdjasd', 'Fuck :D', '2015-11-08 21:40:12'),
(93, 29, 1, 'IAJdjasd', 'Salam brat', '2015-11-08 21:59:39'),
(94, 29, 1, 'boyarkin', 'вообще зашибись двигло, вот только выложил бы базы данных, ото чёт вообще всё под откос, зырькать видосы лень..', '2015-11-09 05:52:33'),
(95, 8, 2, 'OxxxyMiron', 'ого 6000 просмотров', '2015-11-09 19:15:32'),
(98, 6, 2, 'cergmin', 'erhjk;9iuiui', '2015-11-16 11:46:14'),
(99, 4, 2, '7928026w', '4', '2015-11-16 19:30:10'),
(100, 8, 2, 'zews', 'test', '2015-11-22 11:37:50'),
(101, 8, 2, 'Tyosensya', 'А как скачать то?)', '2015-11-23 23:31:27'),
(102, 8, 2, 'Devart', 'жопа жопа', '2015-11-29 14:47:23'),
(103, 8, 2, 'skomeika', '112233', '2015-11-30 18:26:56'),
(104, 28, 1, 'qwertyyyyy', 'ef', '2015-12-01 20:22:54'),
(105, 8, 2, 'qwertyyyyy', 'ed', '2015-12-01 20:23:22'),
(106, 8, 2, 'qwertyyyyy', 'edede', '2015-12-01 20:23:34'),
(107, 4, 2, 'Lenov', 'А где скачать архив с этого урока?', '2015-12-03 17:53:09'),
(108, 8, 2, 'Apophis01', 'kak cka4at?', '2015-12-04 15:38:32'),
(109, 1, 2, 'artre', 'Материал 1', '2015-12-16 20:42:57'),
(110, 25, 1, 'login1', 'норм так', '2015-12-25 13:31:31'),
(111, 1, 2, 'dima42us', 'вцу', '2015-12-27 17:30:55'),
(112, 29, 1, 'm1554', '1337', '2016-01-01 17:58:58'),
(113, 3, 2, 'Giorgi', 'test01', '2016-01-03 18:12:19'),
(114, 16, 1, 'Nikita534', 'тут был nikitos', '2016-01-06 05:39:41'),
(115, 8, 2, 'Ishtvan', 'gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg', '2016-01-07 17:45:49'),
(116, 29, 1, 'Ishtvan', 'gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg', '2016-01-07 17:46:18'),
(117, 8, 2, 'RYVI', 'limbo', '2016-01-08 04:43:30'),
(118, 1, 2, 'maksbeliy5', 'acs', '2016-01-08 21:31:16'),
(119, 8, 2, 'pxstudioru', 'dcdcdcc', '2016-01-09 10:57:29'),
(120, 1, 2, 'fedys', 'sss', '2016-01-10 17:53:45'),
(121, 4, 2, 'fox46', 'А где скачать', '2016-01-15 13:04:08'),
(122, 8, 2, 'venom228', 'Хмм', '2016-01-16 23:10:25'),
(123, 8, 2, 'hot', 'рпыпцп', '2016-01-18 22:45:22'),
(124, 8, 2, 'hot', '&lt;hr&gt;', '2016-01-18 22:46:18'),
(125, 29, 1, 'Jad', '3242344', '2016-01-21 11:24:01'),
(126, 29, 1, 'Jad', 'Что-то аватарка не устанавливаются в профиль', '2016-01-21 11:25:16'),
(127, 5, 2, 'Lord', '25.01.2016 привет)', '2016-01-25 10:43:28'),
(128, 6, 2, 'joor', 'Внизу', '2016-02-03 19:26:00'),
(129, 29, 1, 'joor', 'Всем сюда http://minehosting.zz.mu :D', '2016-02-07 11:38:59'),
(130, 27, 1, 'lolka', 'jjjj', '2016-02-11 20:01:48'),
(131, 29, 1, 'daniil2410', 'Мда', '2016-02-12 20:32:17'),
(132, 29, 1, 'natalie73', 'fgfdgdf', '2016-02-14 22:18:13'),
(133, 27, 1, 'olvitau', 'очень интересная новость!', '2016-02-17 13:13:45'),
(134, 8, 2, 'Dmitry', '1', '2016-02-17 22:14:17'),
(135, 2, 2, 'lolka', '122', '2016-02-21 13:49:56'),
(136, 3, 2, 'CYKAda', 'ааывавы', '2016-02-21 20:35:21'),
(137, 29, 1, 'Nikita-K', 'test', '2016-02-26 18:27:19'),
(138, 1, 2, 'tom', 'ft', '2016-03-03 17:51:51'),
(139, 8, 2, 'lexanchik', 'Цп в ЛС', '2016-03-10 19:53:34'),
(140, 8, 2, 'nurik', 'cool', '2016-03-20 11:58:33'),
(141, 8, 2, 'nurik', 'и где тут отредактировать??', '2016-03-20 11:59:15'),
(142, 7, 2, 'nurik', 'kjkljkl;', '2016-03-20 12:31:10'),
(143, 4, 1, 'Johnny5e0', 'Вац', '2016-03-20 21:03:54'),
(144, 7, 2, 'lolka', '123', '2016-03-25 20:29:39'),
(145, 8, 2, 'Andry', '&lt;?php echo &quot;Тест защитки, Mr_shift&#039;y респект&quot;?&gt;', '2016-03-30 12:57:33'),
(146, 10, 1, 'grisharak', 'Круто че', '2016-04-10 09:11:06'),
(147, 8, 2, 'Thomas454', 'ку ку всем', '2016-04-14 17:06:08'),
(148, 8, 2, 'Thomas454', 'Ну шо как тут у вас?', '2016-04-14 17:06:25'),
(149, 8, 2, 'Romanich', 'привіт)))', '2016-04-15 23:14:09'),
(150, 29, 1, 'Vovan', 'всем привет!', '2016-04-21 18:55:26'),
(151, 8, 2, 'Vovan', 'ну шо там у вас? получается?', '2016-04-21 19:02:12'),
(152, 6, 2, 'Abracadabr', 'А у меня комментарии из формы не добавляются ни в базу ни на страницу, а добавленные в базу через PHPmyadmin появляются на странице. Что это?', '2016-04-21 19:47:22'),
(157, 7, 2, 'zadrot02', 'свппвв', '2016-05-01 14:53:56'),
(158, 1, 2, 'tutorial', 'wtretwert wretew tew wrwe  wt wertw', '2016-05-10 19:23:48'),
(159, 2, 1, 'tutorial', 'rwee werrgewg wr g eg wgeerwgwe g', '2016-05-10 19:24:31'),
(160, 2, 1, 'tutorial', 'grsegser  ssd gdr s drgd', '2016-05-10 19:24:42'),
(161, 29, 1, 'alexx', 'Оценили: TestUser Sireus admin4ik NortOn sistemos IAJdjasd boyarkin CBR wlad96 qwertyyyyy Apophis01 sashca134 simbiot abrek demin881 QHnedd rexxxdj rodiob zenIgor tolia login1 zbot2013 NeonQ Slavik777 rapidpanel Mantana GREEDY m1554 exiu', '2016-05-11 13:20:24'),
(162, 4, 1, 'zarik', '&lt;b&gt;жир&lt;/b&gt;', '2016-05-12 21:52:44'),
(163, 29, 1, 'Kaisten', 'Вот ито дааа', '2016-05-14 20:03:26'),
(164, 29, 1, 'kuna', 'Cool', '2016-05-18 14:43:16'),
(165, 3, 2, 'text333', '&lt;h1&gt;', '2016-05-19 13:20:39'),
(166, 28, 1, '0develop0', 'ХУЙ', '2016-05-20 19:17:40'),
(167, 7, 2, '1111', '111111', '2016-05-29 20:05:41'),
(168, 29, 1, 'slon', 'Добавил: Admin | Оценок: 62 | Дата: 2015-03-06 18:57:30 <br>\r\nОценили: TestUser Sir', '2016-05-31 15:36:30'),
(169, 29, 1, 'slon', 'как  ограничить длину комента? в php через onchange? Удали плиз придыдуший комент.', '2016-05-31 15:41:06'),
(170, 8, 2, 'mavrin', 'yjhv', '2016-06-01 13:09:33'),
(171, 8, 2, 'Bender100', 'dfdfdf', '2016-06-05 22:19:07'),
(172, 8, 2, 'Dinn', '[b]Тест[/b]', '2016-07-05 20:32:12'),
(173, 5, 2, 'mejlon', 'kkggk', '2016-07-18 23:12:55'),
(174, 8, 2, 'mejlon', '5845855', '2016-07-19 13:08:54'),
(175, 8, 2, 'Pitx', 'test', '2016-07-20 18:38:28'),
(176, 8, 2, 'temaror', 'аыв', '2016-07-24 14:05:10'),
(177, 8, 2, 'mydoctor', 'mmm', '2016-07-27 13:59:17'),
(178, 29, 1, 'bot', 'ewfdfsdfsdfazccxvczvczvzxccvzvzxvzxcvzxcvzxvzxcv', '2016-07-29 01:17:23'),
(179, 29, 1, 'avtaritet', 'fbff', '2016-08-03 14:51:47'),
(180, 8, 2, 'e1wd', 'CAMEL', '2016-08-04 17:52:13'),
(181, 3, 2, 'Destero', '&lt;h1&gt;adsdasdsad&lt;/h1&gt;', '2016-08-06 02:08:02'),
(182, 29, 1, 'Apxop', 'еуые', '2016-08-10 19:58:00'),
(183, 8, 2, 'roma', '&lt;script&gt;&lt;script/&gt;', '2016-08-11 10:43:54'),
(184, 29, 1, 'krysti', 'проверка', '2016-08-28 20:26:11'),
(185, 8, 2, 'e777', 'верблюд устал', '2016-09-13 17:47:07');

-- --------------------------------------------------------

--
-- Структура таблицы `dialog`
--

CREATE TABLE IF NOT EXISTS `dialog` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `status` int(11) NOT NULL,
  `send` int(11) NOT NULL,
  `recive` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `forum`
--

CREATE TABLE IF NOT EXISTS `forum` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `section` int(11) NOT NULL,
  `date` datetime NOT NULL,
  `close` int(11) NOT NULL,
  `name` tinytext NOT NULL,
  `author` varchar(20) NOT NULL,
  `last_post` varchar(20) NOT NULL,
  `last_update` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `forum`
--

INSERT INTO `forum` (`id`, `section`, `date`, `close`, `name`, `author`, `last_post`, `last_update`) VALUES
(1, 1, '2016-05-15 00:00:00', 0, 'Тестовая тема из раздела 1', 'admin', 'kusix', '2016-09-16 10:14:49'),
(2, 1, '2016-05-15 00:00:00', 0, 'Еще тема', '12121', 'kusix', '2016-09-16 10:14:49'),
(3, 4, '2016-05-15 00:00:00', 0, 'Тема для раздела 4', '745747', 'kusix', '2016-09-16 10:14:49'),
(4, 5, '2016-05-15 10:19:14', 0, 'Тестовая тема 777', 'TestUser', 'kusix', '2016-09-16 10:27:23'),
(5, 1, '2016-05-15 10:19:39', 0, 'Test', 'TestUser', 'kusix', '2016-09-16 10:14:49'),
(6, 3, '2016-05-15 10:29:22', 0, 'Как сделать тему?', 'TestUser', 'kusix', '2016-09-16 10:14:49'),
(7, 1, '2016-05-15 10:30:24', 0, 'Тестовая тема с сообщением', 'TestUser', 'kusix', '2016-09-16 10:14:49'),
(9, 1, '2016-09-16 10:28:34', 0, 'Привет 123', 'kusix', 'kusix', '2016-09-16 10:28:34'),
(8, 1, '2016-09-15 20:13:45', 0, '123', 'kusix', 'kusix', '2016-09-16 10:14:49');

-- --------------------------------------------------------

--
-- Структура таблицы `forump`
--

CREATE TABLE IF NOT EXISTS `forump` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `topic` int(11) NOT NULL,
  `date` datetime NOT NULL,
  `text` text NOT NULL,
  `author` varchar(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `forump`
--

INSERT INTO `forump` (`id`, `topic`, `date`, `text`, `author`) VALUES
(1, 2, '2016-05-15 00:00:00', 'Сообщение 1', 'Тест'),
(2, 7, '2016-05-15 10:30:24', 'Здесь первое сообщение темы', 'TestUser'),
(3, 7, '2016-05-15 10:42:20', '123', 'TestUser'),
(4, 7, '2016-05-15 10:42:48', '65646', 'TestUser'),
(5, 7, '2016-05-15 10:42:54', '1', 'TestUser'),
(6, 7, '2016-05-15 10:42:55', '2', 'TestUser'),
(7, 7, '2016-05-15 10:42:56', '3', 'TestUser'),
(8, 4, '2016-05-15 10:47:26', 'test', ''),
(9, 2, '2016-05-15 10:52:48', 'Я отвечаю', 'TestUser'),
(10, 2, '2016-05-15 10:53:10', 'версия 2.0', 'TestUser'),
(11, 2, '2016-05-15 10:54:53', '123321', 'TestUser'),
(12, 7, '2016-05-23 10:32:45', '7', 'TestUser'),
(13, 8, '2016-09-15 20:13:45', 'Привет', 'kusix'),
(14, 8, '2016-09-15 20:14:37', 'Хай', 'kusix'),
(15, 2, '2016-09-15 20:19:04', '123', 'kusix'),
(16, 7, '2016-09-16 10:14:49', '123', 'kusix'),
(17, 4, '2016-09-16 10:27:23', '123321', 'kusix'),
(18, 9, '2016-09-16 10:28:34', '456', 'kusix');

-- --------------------------------------------------------

--
-- Структура таблицы `loads`
--

CREATE TABLE IF NOT EXISTS `loads` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` tinytext NOT NULL,
  `cat` int(11) NOT NULL,
  `added` varchar(20) NOT NULL,
  `text` mediumtext NOT NULL,
  `date` datetime NOT NULL,
  `active` int(11) NOT NULL,
  `dimg` int(11) NOT NULL,
  `dfile` int(11) NOT NULL,
  `link` tinytext NOT NULL,
  `rate` int(11) NOT NULL,
  `rateusers` mediumtext NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `loads`
--

INSERT INTO `loads` (`id`, `name`, `cat`, `added`, `text`, `date`, `active`, `dimg`, `dfile`, `link`, `rate`, `rateusers`) VALUES
(1, 'Материал 1', 1, 'Admin', 'Материал 1', '2015-05-24 11:35:11', 1, 1, 1, '0', 22, ',301,359,363,366,365,373,374,381,408,412,477,487,488,527,523,325,676,685,738,761,794,812'),
(2, 'Материал 2', 2, 'Admin', 'Материал 2', '2015-05-24 11:35:46', 1, 1, 1, '0', 6, ',396,430,521,325,620,799'),
(3, 'Материал 3', 3, 'Admin', 'Материал 3', '2015-05-24 11:35:57', 1, 1, 1, '0', 10, ',135,313,314,317,367,475,653,696,661,806'),
(4, 'Материал 4', 1, 'Admin', 'Материал 4', '2015-05-24 11:36:31', 1, 1, 1, '0', 8, ',27,355,489,495,367,609,623,124'),
(5, 'Материал 5', 1, 'Admin', 'Материал 5', '2015-05-24 11:36:50', 1, 1, 1, '0', 17, ',254,314,318,322,357,381,467,507,320,527,566,579,620,654,762,771,809'),
(6, 'Материал 6', 1, 'Admin', 'Материал 6', '2015-05-24 11:37:15', 1, 1, 1, '0', 11, ',326,330,332,343,374,387,398,414,32,545,548'),
(7, 'Материал 7', 1, 'Admin', 'Материал 7', '2015-05-24 11:37:26', 1, 1, 1, '0', 17, ',291,27,345,369,322,396,430,433,458,466,489,515,135,595,600,654,620'),
(8, 'Материал 8', 1, 'Admin', 'Материал 8', '2015-05-24 11:37:43', 1, 1, 1, '0', 91, ',124,1,291,27,297,301,263,307,254,312,236,219,330,320,322,347,360,365,369,374,376,354,325,380,381,390,391,394,398,373,406,414,426,435,447,448,451,452,453,456,458,459,466,476,475,487,489,491,492,493,510,32,515,518,525,535,533,537,550,551,549,584,258,595,600,210,611,609,620,633,436,637,661,664,671,694,704,729,745,753,773,776,779,794,805,804,812,529,806,820,825');

-- --------------------------------------------------------

--
-- Структура таблицы `message`
--

CREATE TABLE IF NOT EXISTS `message` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `did` int(11) NOT NULL,
  `user` int(11) NOT NULL,
  `text` text NOT NULL,
  `date` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE IF NOT EXISTS `news` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` tinytext NOT NULL,
  `cat` int(11) NOT NULL,
  `added` varchar(20) NOT NULL,
  `text` tinytext NOT NULL,
  `date` datetime NOT NULL,
  `active` int(11) NOT NULL DEFAULT '1',
  `rate` int(11) NOT NULL,
  `rateusers` mediumtext NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=118 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `name`, `cat`, `added`, `text`, `date`, `active`, `rate`, `rateusers`) VALUES
(2, 'Новость 2', 2, 'Admin', 'Текст', '2015-03-02 00:00:00', 1, 4, ',381,475,322,762'),
(3, 'Новость 3', 3, 'Admin', 'текст....', '2015-03-02 08:24:41', 1, 1, ',719'),
(4, 'Новость 4', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 1, ',551'),
(5, 'Новость 5', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 0, ''),
(6, 'Новость 6', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 0, ''),
(7, 'Новость 7', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 0, ''),
(8, 'Новость 8', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 0, ''),
(9, 'Новость 9', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 1, ',523'),
(10, 'Новость 10', 2, 'Admin', 'текст....', '2015-03-02 08:24:41', 1, 1, ',671'),
(11, 'Новость 11', 2, 'Admin', 'текст....', '0000-00-00 00:00:00', 1, 0, ''),
(12, 'Новость 12', 2, 'Admin', 'текст....', '2015-03-06 18:56:37', 1, 1, ',32'),
(13, 'Новость 13', 2, 'Admin', 'текст....', '2015-03-06 18:57:30', 1, 0, ''),
(14, 'Новость 14', 2, 'Admin', 'текст....', '2015-03-06 18:57:30', 1, 1, ',291'),
(15, 'Новость 15', 2, 'Admin', 'текст....', '2015-03-06 18:57:30', 1, 0, ''),
(29, 'Новость 29', 2, 'Admin', 'текст....', '2015-03-06 18:57:30', 1, 78, ',1,124,291,27,322,323,326,328,320,362,381,390,391,332,398,373,406,415,422,426,428,429,437,444,451,446,452,458,461,462,472,473,313,479,490,493,506,511,524,525,539,551,549,557,564,563,578,588,589,595,602,605,608,615,442,633,661,664,640,691,702,711,735,611,748,569,754,758,762,779,780,784,787,794,799,812,818,820'),
(28, 'Новость 28', 2, 'Admin', 'текст....', '2015-03-06 18:57:30', 1, 12, ',322,380,451,458,486,328,581,657,661,671,701,584'),
(27, 'Новость 27', 2, 'Admin', 'текст....', '2015-03-06 18:56:37', 1, 4, ',1,497,528,322'),
(26, 'Новость 26', 2, 'Admin', 'текст....', '0000-00-00 00:00:00', 1, 0, ''),
(25, 'Новость 25', 2, 'Admin', 'текст....', '2015-03-02 08:24:41', 1, 3, ',452,487,607'),
(24, 'Новость 24', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 1, ',711'),
(23, 'Новость 23', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 0, ''),
(22, 'Новость 22', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 0, ''),
(21, 'Новость 21', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 0, ''),
(20, 'Новость 20', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 0, ''),
(19, 'Новость 19', 2, 'Admin', 'текст....', '2015-03-02 10:00:00', 1, 2, ',414,529'),
(18, 'Новость 18', 3, 'Admin', 'текст....', '2015-03-02 08:24:41', 1, 4, ',325,375,444,596'),
(16, 'Новость 16', 1, 'Admin', 'Текст', '2015-03-01 00:00:00', 1, 1, ',620'),
(17, 'Новость 17', 2, 'Admin', 'Текст', '2015-03-02 00:00:00', 1, 0, '');

-- --------------------------------------------------------

--
-- Структура таблицы `notice`
--

CREATE TABLE IF NOT EXISTS `notice` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `status` int(11) NOT NULL,
  `date` datetime NOT NULL,
  `text` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `online`
--

CREATE TABLE IF NOT EXISTS `online` (
  `user` varchar(20) NOT NULL,
  `ip` text NOT NULL,
  `time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `payment`
--

CREATE TABLE IF NOT EXISTS `payment` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login` varchar(20) NOT NULL,
  `amount` float NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `payment`
--

INSERT INTO `payment` (`id`, `login`, `amount`) VALUES
(2, 'MrShift', 10),
(3, 'MrShift', 100.72);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `regdate` datetime NOT NULL,
  `email` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `country` int(11) NOT NULL,
  `avatar` int(11) NOT NULL,
  `active` int(11) NOT NULL,
  `group` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
