-- phpMyAdmin SQL Dump
-- version 4.2.11
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Мар 18 2015 г., 17:13
-- Версия сервера: 5.5.36-34.0-632.precise
-- Версия PHP: 5.3.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `shiftmr_youtube`
--

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE IF NOT EXISTS `news` (
`id` int(11) NOT NULL,
  `name` tinytext NOT NULL,
  `cat` int(11) NOT NULL,
  `read` int(11) NOT NULL,
  `added` varchar(20) NOT NULL,
  `text` text NOT NULL,
  `date` datetime NOT NULL
) ENGINE=MyISAM AUTO_INCREMENT=103 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `name`, `cat`, `read`, `added`, `text`, `date`) VALUES
(1, 'Новость 1', 1, 1, 'Admin', 'Текст', '2015-03-01 00:00:00'),
(2, 'Новость 2', 2, 0, 'Admin', 'Текст', '2015-03-02 00:00:00'),
(3, 'Новость 3', 3, 0, 'Admin', 'текст....', '2015-03-02 08:24:41'),
(4, 'Новость 4', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(5, 'Новость 5', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(6, 'Новость 6', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(7, 'Новость 7', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(8, 'Новость 8', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(9, 'Новость 9', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(10, 'Новость 10', 2, 0, 'Admin', 'текст....', '2015-03-02 08:24:41'),
(11, 'Новость 11', 2, 0, 'Admin', 'текст....', '0000-00-00 00:00:00'),
(12, 'Новость 12', 2, 0, 'Admin', 'текст....', '2015-03-06 18:56:37'),
(13, 'Новость 13', 2, 0, 'Admin', 'текст....', '2015-03-06 18:57:30'),
(14, 'Новость 14', 2, 0, 'Admin', 'текст....', '2015-03-06 18:57:30'),
(15, 'Новость 15', 2, 2, 'Admin', 'текст....', '2015-03-06 18:57:30'),
(30, 'Новость 30', 2, 17, 'Admin', 'текст....', '2015-03-06 18:57:30'),
(29, 'Новость 29', 2, 0, 'Admin', 'текст....', '2015-03-06 18:57:30'),
(28, 'Новость 28', 2, 0, 'Admin', 'текст....', '2015-03-06 18:57:30'),
(27, 'Новость 27', 2, 0, 'Admin', 'текст....', '2015-03-06 18:56:37'),
(26, 'Новость 26', 2, 1, 'Admin', 'текст....', '0000-00-00 00:00:00'),
(25, 'Новость 25', 2, 0, 'Admin', 'текст....', '2015-03-02 08:24:41'),
(24, 'Новость 24', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(23, 'Новость 23', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(22, 'Новость 22', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(21, 'Новость 21', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(20, 'Новость 20', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(19, 'Новость 19', 2, 0, 'Admin', 'текст....', '2015-03-02 10:00:00'),
(18, 'Новость 18', 3, 0, 'Admin', 'текст....', '2015-03-02 08:24:41'),
(16, 'Новость 16', 1, 0, 'Admin', 'Текст', '2015-03-01 00:00:00'),
(17, 'Новость 17', 2, 0, 'Admin', 'Текст', '2015-03-02 00:00:00');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `news`
--
ALTER TABLE `news`
 ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `news`
--
ALTER TABLE `news`
MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=103;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
